xmls/wgms_new_WPT.xml

<?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
     <soap:Body>
        <CreateEntity xmlns="http://gliders.liquidr.com/webservicesWebServices"><entityType>53</entityType>
         <entityFieldXml>
       %3Centity%3E%3CWaypointName%3E
    SG526 2022-03-24 00:27:33 UTC
       %3C%2FWaypointName%3E%3CWaypointNumber
       %3E
    55
       %3C%2FWaypointNumber%3E%3CVehicleId%3E
    4980
       %3C%2FVehicleId%3E%3CCommunicationChannelSelect
       %3E
    6
       %3C%2FCommunicationChannelSelect%3E%3CVisible%3E1%3C%2FVisible%3E%3CWaypointStatus%3E1%3C%2FWaypointStatus%3E
       %3CLattitude%3E
    14.28795
       %3C%2FLattitude%3E%3CLongitude%3E
    144.98680000000002
       %3C%2FLongitude%3E%3C%2Fentity%3E
         </entityFieldXml>
        </CreateEntity>
      </soap:Body>
    </soap:Envelope>
    